In [1]:
import pandas as pd

## Read train and test data

In [2]:
train_data = pd.read_csv("D:/ML_Datasets/train.csv")

In [3]:
test_data = pd.read_csv("D:/ML_Datasets/test.csv")

## Display 5 rows of train and test data

In [4]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
train_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# Remove rows with missing values from train and test data

In [7]:
train_data = train_data.dropna(axis=0)  #remove rows with missing values

In [8]:
test_data = test_data.dropna(axis=0)  #remove rows with missing values

In [9]:
print(train_data)

     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
10            11         1       3
11            12         1       1
..           ...       ...     ...
871          872         1       1
872          873         0       1
879          880         1       1
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch    Ticket     Fare        Cabin Embarked
1        0  PC 17599  71.2833          C85        C
3        0    113803  53.1000         C123        S
6        0     17463  51.8625          E46        S
10       1   PP 9549  16.7000           G6        S
11       0    113783  26.5500         C103        S
..     ...       ...      ...          ...      ...
871      1     11751  52.5542          D35        S
872      0       695   5.0000  B51 B53 B55        S
879      1     11767  83.1583          C50        C
887      0    112053  30.0000          B42        S
889      0    111369  30.0000         C148        C

[183 rows x 12 columns]

In [10]:
print(test_data)  #print after removing rows with missing values

     PassengerId  Pclass                                               Name  \
12           904       1      Snyder, Mrs. John Pillsbury (Nelle Stevenson)
14           906       1  Chaffee, Mrs. Herbert Fuller (Carrie Constance...
24           916       1    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)
26           918       1                       Ostby, Miss. Helene Ragnhild
28           920       1                            Brady, Mr. John Bertram
..           ...     ...                                                ...
404         1296       1                       Frauenthal, Mr. Isaac Gerald
405         1297       2       Nourney, Mr. Alfred (Baron von Drachstedt")"
407         1299       1                         Widener, Mr. George Dunton
411         1303       1    Minahan, Mrs. William Edward (Lillian E Thorpe)
414         1306       1                       Oliva y Ocana, Dona. Fermina

        Sex   Age  SibSp  Parch         Ticket      Fare            Cabin  \
12   female  23.0      1      0          21228   82.2667              B45
14   female  47.0      1      0    W.E.P. 5734   61.1750              E31
24   female  48.0      1      3       PC 17608  262.3750  B57 B59 B63 B66
26   female  22.0      0      1         113509   61.9792              B36
28     male  41.0      0      0         113054   30.5000              A21
..      ...   ...    ...    ...            ...       ...              ...
404    male  43.0      1      0          17765   27.7208              D40
405    male  20.0      0      0  SC/PARIS 2166   13.8625              D38
407    male  50.0      1      1         113503  211.5000              C80
411  female  37.0      1      0          19928   90.0000              C78
414  female  39.0      0      0       PC 17758  108.9000             C105

    Embarked
12         S
14         S
24         C
26         C
28         S
..       ...
404        C
405        C
407        C
411        Q
414        C

[87 rows x 11 columns]

# Select features to train model

In [11]:
features = ["Pclass", "Sex", "SibSp", "Parch"]

# Select model to train

In [12]:
#from sklearn.tree import DecisionTreeRegressor
#from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier

In [13]:
#titanic_model = DecisionTreeRegressor(random_state = 1)
#titanic_model =  LogisticRegression()
titanic_model = RandomForestClassifier(random_state = 1)

# Store target and features in y and X resp

In [14]:
y = train_data.Survived

In [15]:
X_train = pd.get_dummies(train_data[features])    #pd.get_dummies converts categorical data into dummy or indicator varaibles

In [16]:
X_test = pd.get_dummies(test_data[features])

In [17]:
X_train.describe()

           Pclass       SibSp       Parch  Sex_female    Sex_male
count  183.000000  183.000000  183.000000  183.000000  183.000000
mean     1.191257    0.464481    0.475410    0.480874    0.519126
std      0.515187    0.644159    0.754617    0.501005    0.501005
min      1.000000    0.000000    0.000000    0.000000    0.000000
25%      1.000000    0.000000    0.000000    0.000000    0.000000
50%      1.000000    0.000000    0.000000    0.000000    1.000000
75%      1.000000    1.000000    1.000000    1.000000    1.000000
max      3.000000    3.000000    4.000000    1.000000    1.000000

In [18]:
X_test.describe()

          Pclass      SibSp      Parch  Sex_female   Sex_male
count  87.000000  87.000000  87.000000   87.000000  87.000000
mean    1.137931   0.597701   0.482759    0.505747   0.494253
std     0.435954   0.637214   0.860801    0.502865   0.502865
min     1.000000   0.000000   0.000000    0.000000   0.000000
25%     1.000000   0.000000   0.000000    0.000000   0.000000
50%     1.000000   1.000000   0.000000    1.000000   0.000000
75%     1.000000   1.000000   1.000000    1.000000   1.000000
max     3.000000   3.000000   4.000000    1.000000   1.000000

In [19]:
X_test.head()

    Pclass  SibSp  Parch  Sex_female  Sex_male
12       1      1      0           1         0
14       1      1      0           1         0
24       1      1      3           1         0
26       1      0      1           1         0
28       1      0      0           0         1

# Fit the model using train data

In [20]:
titanic_model.fit(X_train,y)

RandomForestClassifier(random_state=1)

# Predict using test data

In [21]:
print(titanic_model.predict(X_test.head()))

[1 1 0 1 0]

In [22]:
print(y)

1      1
3      1
6      0
10     1
11     1
      ..
871    1
872    0
879    1
887    1
889    1
Name: Survived, Length: 183, dtype: int64

# Validate model by evaluating MAE

In [23]:
from sklearn.metrics import mean_absolute_error

In [24]:
prediction = titanic_model.predict(X_test)

In [25]:
mean_absolute_error(y.head(87), prediction)

0.39080459770114945

In [26]:
!PWD

'PWD' is not recognized as an internal or external command,
operable program or batch file.

In [27]:
!pwd

'pwd' is not recognized as an internal or external command,
operable program or batch file.

In [28]:
import os

In [29]:
!pwd

'pwd' is not recognized as an internal or external command,
operable program or batch file.

In [30]:
cd

C:\Users\Aisha